def solution(letter):
    morse = { 
        '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
        '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
        '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
        '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
        '-.--':'y','--..':'z'
    }
    
    # letter.split(): 공백을 기준으로 문자열을 쪼개어 리스트로 만듦
    # morse[m]: 쪼개진 각각의 모스부호(m)를 딕셔너리의 키로 사용하여 알파벳 값을 찾음
    # "".join(): 찾아낸 알파벳 리스트를 하나의 문자열로 쫙 이어 붙임
    return "".join(morse[m] for m in letter.split())